cases/Reactive_Transport/precipitation/0.org/Ccl
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccl;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    left
    {
        //type            zeroGradient;
		type			fixedValue;
		value			uniform 1;
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
}


// ************************************************************************* //
