cases/Reactive_Transport/precipitation/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     7;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
          type            fixedValue;
          value      uniform 1e-8;
     }

    right
    {
         type            fixedValue;
          value      uniform 0;
    }

     bottom
    {
       type            cyclic;
    }
    
    top
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
    
    fixedWalls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
