cases/Reactive_Transport/precipitation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     7;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

rhof			rhof [1 -3 0 0 0 0 0] 1000;
muf				muf [1 -1 -1 0 0 0 0] 1.2e-5;
D           D            [0 2 -1 0 0 0 0]  1.6e-9;
nu              nu [0 2 -1 0 0 0 0] 1e-04;
a             a            [1 0 0 0 -1 0 0] 1;
b             b          [0 0 1 0 0 0 0] 1;
c             c            [0 1 0 0 0 0 0] 1;
Dca           Dca            [0 2 -1 0 0 0 0]  1e-9;
Dco3          Dco3            [0 2 -1 0 0 0 0]  1e-9;
//Ku            Ku          [0 0 -1 0 0 0 0] 8.33e-5;
Kp            Kp          [0 0 -1 0 0 0 0] 1e-2;
//Km            Km          [1 -3 0 0 0 0 0] 0.301;
rhoCaCO3            rhoCaCO3          [1 -3 0 0 0 0 0] 1620;
MWCaCO3             MWCaCO3            [0 0 0 0 0 0 0] 100.869;
/*
nu              nu [0 2 -1 0 0 0 0] 1e-04;
beta			beta [0 0 0 0 0 0 0] 1;
kr				kr [0 -2 -1 0 1 0 0] 0.89;
Sr				Sr [0 -1 0 0 0 0 0] 5e4;
Deca			Deca [0 2 -1 0 0 0 0] 7.92e-9;
Decl			Decl [0 2 -1 0 0 0 0] 2.03e-9;
Deh				Deh [0 2 -1 0 0 0 0] 9.31e-9;
Dena			Dena [0 2 -1 0 0 0 0] 1.33e-9;
Deco3			Deco3 [0 2 -1 0 0 0 0] 9.23e-9;
Decaco3			Decaco3 [0 2 -1 0 0 0 0] 8e-9;
alphaCa			alphaCa [0 -3 0 0 1 0 0] 2e-4;
alphaCO3		alphaCO3 [0 -3 0 0 1 0 0] 2e-3;
Ksp				Ksp [0 -6 0 0 2 0 0] 1e-8;
rhocaco3		rhocaco3 [1 -3 0 0 0 0 0] 2.75e3;
Vcaco3			Vcaco3 [0 3 0 0 -1 0 0] 3.747e-5;	
Mcaco3			Mcacoe [1 0 0 0 -1 0 0] 0.1; //Caco3物质的量
*/
gradC_sat       gradC_sat [0 -3 0 0 1 0 0] 0;
// ************************************************************************* //
