cases/Reactive_Transport/precipitation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration    | Version:  7                                     |
|   \\  /    A nd          | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// The field to set
fields
(
    eps
    //Cca
    Ccaco3
    Cco3
);

// Method of setting the field
setFormat raw;

// Set the STL file as the region to apply the field
regions
(   
    boxToCell
    {
        box (-0.00125 -0.000625 0)(0.00125 0.000625 0.00001);
        fieldValues
        (
           volScalarFieldValue eps 1
           volScalarFieldValue Ccaco3 0.0001
		   //volScalarFieldValue Cca 0.0001
		   volScalarFieldValue Cco3 0.0001
           );
    }

    surfaceToCell
    {
        file "constant/triSurface/solid0.stl";
        outsidePoints // definition of outside
        (
           (-0.0007 0.0002 0.000005)
        ); 
        includeCut true; // cells cut by surface
        includeInside yes; // cells not on outside of surf
        includeOutside no; // cells on outside of surf
        nearDistance -2; // cells with centre near surf
        curvature 0.9; // cells within nearDistance
        fieldValues
        (
            volScalarFieldValue eps 0.0001
			//volScalarFieldValue Cco3 0.0001
        );
    }
    
    surfaceToCell
    {
        file "constant/triSurface/pre0.stl";
        outsidePoints // definition of outside
        (
            (-0.0001 -0.00025 0.000005)
        ); 
        includeCut true; // cells cut by surface
        includeInside yes; // cells not on outside of surf
        includeOutside no; // cells on outside of surf
        nearDistance -1; // cells with centre near surf
        curvature 0.9; // cells within nearDistance
        fieldValues
        (
            volScalarFieldValue Cco3 0.6
            //volScalarFieldValue Ccaco3 0.6
            //volScalarFieldValue eps 0.0001
        );
    }
);

// Default value for points not inside the set region
defaultValue uniform (0 0 0);

// Method of interpolating values for points not inside the set region
interpolationScheme cell;

// Write output to time directories
writeControl timeStep;



// ************************************************************************* //
